In [1]:
df = pd.DataFrame({'age': [5, 6, np.NaN],
                 'born': [pd.NaT, pd.Timestamp('1939-05-27'),
                           pd.Timestamp('1940-04-25')],
                  'name': ['Alfred', 'Batman', ''],
                   'toy': [None, 'Batmobile', 'Joker']})

In [2]:
df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [3]:
df.isnull()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

In [4]:
df.isna()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

In [6]:
df.notna()+df.isna()

c:\python36\lib\site-packages\pandas\core\computation\expressions.py:180: UserWarning: evaluating in Python space because the '+' operator is not supported by numexpr for the bool dtype, use '|' instead
  .format(op=op_str, alt_op=unsupported[op_str]))

    age  born  name   toy
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True

In [7]:
df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [8]:
df.dropna()

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile